{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Business Technology Management",
      "department": "Ted Rogers School of Management",
      "duration": "Sep 2019 - Jun 2021",
      "school_name": "Ryerson University"
    },
    {
      "awards_achievements": null,
      "degree": "Business Administration",
      "department": "School of Business",
      "duration": "Sep 2016 - Aug 2019",
      "school_name": "Seneca College"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_MiguelDario",
  "highlighted_projects": [
    {
      "description": "Utilized R to analyze a dataset for a fictitious Portuguese bank to predict whether a client will subscribe to a term deposit. Explored the data by plotting graphs representing customer age, and contact duration distribution. Analyzed the dataset using K nearest, and decision trees. Wrote a report outlining, the project objective, learning methods used, and findings in the data. Presented to the class using Google Slides.",
      "name": "Business Intelligence and Analytics Final Course project"
    },
    {
      "description": "Utilized Python (pandas, numpy, seaborn) to analyze a dataset of Mashable articles to predict the popularity of an article based on the number of shares on social media, and an online shopping dataset to predict if a user will end up buying something. Explored data splitting the data into training, and test datasets, and removing any blank rows. Implemented using k-nearest neighbour, decision trees, and support vector machine. Wrote a report outlining, the project objective, learning methods used, and findings in the data. Presented to the class using Google Slides.",
      "name": "Big Data Analytics Final Course project"
    },
    {
      "description": "Documentation of Manawa Networks' on-boarding process. The basic process consists of configuring up a new or existing workstation for an employee, creating their accounts in Microsoft 365, and the Active Directory, downloading requested applications, and shipping the workstation. Gathered requirements from Director of Technology Success. The main requirement of this document was for it to be written in such a way that anyone can understand and follow instructions without any help.",
      "name": "On-boarding process documentation"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Elicited requirements for a Linux Cluster Resource monitoring by meeting stakeholders such as the Cluster Administration team, Support Team, and Implementation team. Prepared a systems requirement document outlining the project scope, functional, and non-functional requirements, and data modelling to be used by the solution designer. Visualized the system architecture using draw.io The purpose of the system is to collect hardware information, and usage of each host and store it in an RDBMS for future planning purposes. The implementation consists of a monitoring agent with two bash scripts. One to collect hardware information, and another to monitor hardware usage every minute which will be automated using crontab. A PostgreSQL instance provisioned with Docker will be used to store the information.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_MiguelDario/tree/main/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    },
    {
      "description": "Partnered with London Gift Shop (LGS) to address stagnant wage growth from LGS in recent years. Requirements include a proof-of-concept analytics solution that will analyze customer shopping behaviour. Analyzed using Python, along with libraries such as Pandas, NumPy, SQLAlchemy and Matplotlib. Visualized the analysis using Jupyter Notebook. Data used for the project is sourced from a LGS' Azure SQL Server, and will be dumped into Jarvis' PostgreSQL data warehouse. The Jupyter Notebook and database are Dockerized. The analysis will be used by LGS' marketing team to create new marketing campaigns, and attract new customers.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_MiguelDario/tree/develop/python_data_analytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "Evaluated the performance of various Hadoop and is various components such as MapReduce, YARN, and HDFS. Provisioned a Hadoop Cluster using Dataproc consisting of 1 master node, and 2 worker nodes. Loaded the data into HDFS and, analyzed using Apache Hive. Performed various tasks on the data such as partitioning in order to optimize query performance, and compare execution time. Results are displayed in a Zeppelin Notebook.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_MiguelDario/tree/develop/hadoop",
      "name": "Hadoop"
    }
  ],
  "name": "Miguel Dario",
  "others": [
    {
      "bullets": [
        "Python Bootcamp, Ryerson University (2020)",
        "Tableau Bootcamp, Ryerson University (2020)",
        "R Bootcamp, Ryerson University (2020)",
        "Power of Excel Bootcamp, Ryerson University (2020)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Video Games (Rainbow 6 Siege)",
        "Computers (Hardware, Software)",
        "Travelling, been to 8 countries"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Manawa Networks",
      "description": "Documented IT systems and standards for over 25 clients across various industries, Attended regular inter-department meetings with internal, and external stakeholders to review current company standards, and suggest improvements in IT processes. Developed project management, and leadership skills through leading a project to migrate over 120 users to 2-factor authentication. Demonstrated problem-solving skills by providing technical assistance, and support by phone to end users in a friendly, and professional manner.",
      "duration": "Sep 2021 - Jan 2022",
      "title": "Technology Alignment Intern"
    }
  ],
  "skills": {
    "Business Skills": [
      "Documentation",
      "Stakeholder Management",
      "Presentation",
      "Requirements Elicitation",
      "Agile/Scrum",
      "Leadership",
      "Project Management",
      "Time Management",
      "Problem Solving",
      "Communication"
    ],
    "Technical Skills": [
      "Data Analytics with Python, Tableau, and R",
      "RDMBS/SQL",
      "Git/Github",
      "Google Workspace",
      "Microsoft Windows",
      "Microsoft Word",
      "Microsoft PowerPoint",
      "Microsoft Excel (Pivot Tables/Formulas)",
      "Linux/Bash",
      "Microsoft Visio",
      "UML",
      "BPMN",
      "Google Cloud Platform",
      "Hadoop"
    ]
  },
  "summary": "My name is Miguel Dario, and I am a recent graduate from Ryerson University with a Bachelor of Commerce in Business Technology Management. Throughout my education, I was exposed to business fields such as data analytics, project management, as well as languages such as Python, R, and SQL. I am currently a Business Systems Analyst trainee for Jarvis where I applied the skills I have learned in school in addition to gaining new ones, namely Hadoop, Linux, and Agile. I have previously worked as an intern for Manawa Networks where I developed strong stakeholder management skills through identifying gaps in client IT processes, and documenting IT standards. My passion, and ability to bridge the gap between technology and people make me a great fit for a Business Systems Analyst role."
}
